LANGUAGE_MATCHING = {
    'cpp': 'GNU C++ 7.4.0',
    'py': 'Python 3.6',
    'txt': 'Plain Text'
}

STATUS_MATCHING = {
    'In queue': 'В очереди',
    'Compiling': 'Компилирование...',
    'Running': 'Выполняется...',
    'Partial': 'Неполное решение',
    'Accepted': 'OK',
    'CE': 'Ошибка компиляции',
    'PE': 'Неправильный формат вывода',
    'RE': 'Ошибка исполнения',
    'ML': 'Превышено ограничение по памяти',
    'TL': 'Превышено ограничение по времени',
    'IL': 'Превышено ограничение реального времени',
    'WA': 'Неправильный ответ',
    'OK': 'OK',
    'FAIL': 'Ошибка проверки'
}
